import React from 'react';
import Select_item from '../Select_item';

const Gun_select = () => {
    const params = ['Класс', 'Боеприпасы', 'Темп огня', 'Точность', 'Дальность', 'Отдача', 'Магазин', 'Вес', 'Ресурс', 'Стоимость'];
    const values_1 = ['Штурмовые винтовки', '5,45x39 5,45x39ммБП', ' 600 выс./мин.', '0,2 гр.', '1000 м.', '0,15 гр.', '30 патр.', '3,30 кг.', '10000 выст.', '2000 RU', 50];
    const values_2 = ['Ручные гранатометы', 'ВОГ-25 ВОГ-25Р', '100 выс./мин.', '0,5 гр.', '100 м', '4,0 гр.', '6 гранат', '6,20 кг', '33333 выстрелов', '12000 RU', 60];
    const values_3 = ['Снайперские винтовки', '9х39ммСП-5 9х39ммСП-6 9х39ммПАБ-9', '600 выс./мин.', '0,05 гр.', '400 м', '0,125 гр.', '10 патр.', '3,20 кг', '5000 выстрелов', '12000 RU', 100];
    const values_4 = ['Пистолеты-пулемёты', '9х19ммFMJ 9x19ммJHP', '800  выс./мин.', '0.25 гр.', '200  м', '0.2 гр.', '30 патр.', '2.50 кг', '5000 выстрелов', '1100 RU', 40];
    const values_5 = ['Снайперские винтовки', 'Аккумуляторы', '30  выс./мин.', '0,01 гр.', '1000  м', '0,05 гр.', '10 патр.', '5,5 кг', '100000 выстрелов', '25000 RU', 80];
    const values_6 = ['Штурмовые винтовки', '5,56х45мм 5,56x45ммAP', '850 выс./мин.', '0,14 гр.', '600 м', '0.2 гр.', '30 патр.', '3.60 кг', '5000 выстрелов', '18000 RU', 90];
    const values_7 = ['Штурмовые винтовки', '9х39ммПАБ-9 9х39ммСП-5 9х39ммСП-6', '750 выс./мин.', '0.18 гр.', '400 м', '0.3 гр.', '20 патр.', '3.20 кг', '10000 выстрелов', '10000 RU', 70];
    const values_8 = ['Штурмовые винтовки', '5,56х45мм 5,56x45ммAP', '650 выс./мин.', '0.25 гр.', '800 м', '0.15 гр.', '30 патр.', '5.00 кг', '5000 выстрелов', '4000 RU', 60];
    const values_9 = ['Дробовики', '2х70дробь 12x76жекан 12x76дротик', '500 выс./мин.', '0,5 гр.', '50 м', '4,0 гр.', '2 патр.', '1,90 кг', '1000 выстрелов', '400 RU', 30];
    const values_10 = ['Гранатомёты', 'ГранатаОГ-7B', 'одиночный выстрел.', '1.5 гр.', '400  м', '6.0 гр.', '1 граната', '6.30 кг', '33333 выстрелов', '10000 RU', 50];
    const values_11 = ['Штурмовые винтовки', '9х39ммСП-5 9х39ммСП-6 9х39ммПАБ-9', '650 выс./мин.', '0.14 гр.', '400  м', '0.3 гр.', '20 патр.', '2.50 кг', '5000 выстрелов', '9000 RU', 80];
    const values_12 = ['Снайперские винтовки', '7,62x54мм7H1 7,62х54Rмм7Н14 7,62x54ммБП', '120 выс./мин.', '0,03 гр.', '1000 м', '2,0 гр.', '10 патр.', '4,90 кг', '5000 выстрелов', '15000 RU', 90];
    const values_13 = ['Дробовики', '12х70дробь 12x76жекан 12x76дротик', '150 выс./мин.', '0.5 гр.', '50 м', '5.0 гр.', '8 патр.', '4.4 кг', '3333 выстрелов', '2000 RU', 40];
    const values_14 = ['Штурмовые винтовки', '5,56х45мм 5,56x45ммAP', '750 выс./мин.', '0.18 гр.', '400 м', '0.15 гр.', '30 патр.', '2.70 кг', '10000 выстрелов', '5000 RU', 50];
    const values_15 = ['Штурмовые винтовки', '5,56х45мм 5,56x45ммAP M203', '860 выс./мин.', '0.2 гр.', '400 м', '0.2 гр.', '30 патр.', '4.60 кг', '5000 выстрелов', '17000 RU', 100];


    return (
        <div>
            <Select_item name='АКМ-74/2' img='Иконка_АКМ' params={params}  values={values_1} slot='gun' />
            <Select_item name='Бульдог-6' img='Иконка_Бульдога-6' params={params}  values={values_2} slot='gun' />
            <Select_item name='Винтарь-ВС' img='Иконка_Винтарь-ВС' params={params}  values={values_3} slot='gun' />
            <Select_item name='Гадюка-5' img='Гадюка-5' params={params}  values={values_4} slot='gun' />
            <Select_item name='Гаусс-пушка' img='Иконка_гаусс-пушки' params={params}  values={values_5} slot='gun' />
            <Select_item name='ГП37' img='ГП37' params={params}  values={values_6} slot='gun' />
            <Select_item name='Гром-С14' img='Гром-С14' params={params}  values={values_7} slot='gun' />
            <Select_item name='ИЛ86' img='ИЛ86' params={params}  values={values_8} slot='gun' />
            <Select_item name='Обрез' img='Иконка_обреза' params={params}  values={values_9} slot='gun' />
            <Select_item name='РПГ-7у' img='Иконка_РПГ-7у' params={params}  values={values_10} slot='gun' />
            <Select_item name='СА «ЛАВИНА»' img='Иконка_СА_«Лавина»' params={params}  values={values_11} slot='gun' />
            <Select_item name='СВДм-2' img='Иконка_СВДм-2' params={params}  values={values_12} slot='gun' />
            <Select_item name='СПСА-14' img='Иконка_СПСА-14' params={params}  values={values_13} slot='gun' />
            <Select_item name='ТРс-301' img='Иконка_ТРс-301_ТЧ' params={params}  values={values_14} slot='gun' />
            <Select_item name='ФТ-200М' img='ФТ-200М' params={params}  values={values_15} slot='gun' />
        </div>
    );
}

export default Gun_select;