const Artefacts_storage = () => {
    return [['Здоровье', 'Выносливость', 'Удар', 'Разрыв', 'Пулестойкость', 'Электрошок', 'Кровотечение', 'Ожог', 'Хим. ожог', 'Радиация', 'Стоимость'],
           [['Бенгальский огонь', 'Бенгальский_огонь(ico)', ['', '+36', '', '', '', '10', '', '', '', '', '1000']],
           ['Вспышка', 'Вспышка(ico)', ['', '+73', '', '', '', '10', '', '', '', '', '2500']],
           ['Лунный свет', 'Лунный_свет(ico)', ['', '+109', '', '', '', '10', '', '', '', '', '5000']],
           ['Кровь камня', 'Кровь_камня(ico)', ['+200%', '', '-10%', '-10%', '-10%', '', '', '', '', '', '1000']],
           ['Ломоть мяса', 'Ломоть_мяса(ico)', ['+400%', '', '-10%', '-10%', '-10%', '', '', '', '', '', '2500']],
           ['Душа', 'Душа(ico)', ['+600%', '', '-10%', '-10%', '-10%', '', '', '', '', '', '5000']],
           ['Слизь', 'Слизь(ico)', ['', '', '', '', '', '', '+133%', '-10%', '-10%', '', '1000']],
           ['Слизняк', 'Слизняк(ico)', ['', '', '', '', '', '', '+267%', '-10%', '-10%', '', '2500']],
           ['Слюда', 'Слюда(ico)', ['', '', '', '', '', '', '+400%', '-10%', '-10%', '', '5000']],
           ['Медуза', 'Медуза(ico)', ['', '', '', '', '+2%', '', '', '', '', '+5%', '1000']],
           ['Каменный цветок', 'Каменный_цветок(ico)', ['', '', '', '', '+3%', '', '', '', '', '+5%', '2500']],
           ['Ночная звезда', 'Ночная_звезда(ico)', ['', '', '', '', '+5%', '', '', '', '', '+5%', '5000']],
           ['Выверт', 'Выверт(ico)', ['', '', '', '+2%', '', '', '', '', '', '+5%', '1000']],
           ['Грави', 'Грави(ico)', ['', '', '', '+3%', '', '', '', '', '', '+5%', '2500']],
           ['Золотая рыбка', 'Золотая_рыбка(ico)', ['', '', '', '+5%', '', '', '', '', '', '+5%', '5000']],
           ['Колобок', 'Колобок(ico)', ['', '', '', '+5%', '', '', '', '', '', '', '5000']],
           ['Колючка', 'Колючка(ico)', ['', '', '', '', '', '', '-100%', '', '', '-10%', '1000']],
           ['Кристальная колючка', 'Кристальная_колючка(ico)', ['', '', '', '', '', '', '-100%', '', '', '-20%', '2500']],
           ['Морской ёж', 'Морской_ёж(ico)', ['', '', '', '', '', '', '-100%', '', '', '-30%', '5000']],
           ['Капли', 'Капли(ico)', ['', '-18', '', '', '', '', '', '', '', '-10%', '1000']],
           ['Огненный шар', 'Огненный_шар(ico)', ['', '-18', '', '', '', '', '', '', '', '-20%', '2500']],
           ['Кристалл', 'Кристалл(ico)', ['', '-18', '', '', '', '', '', '', '', '-30%', '5000']],
           ['Пустышка', 'Пустышка(ico)', ['', '', '', '', '', '', '', '+30%', '', '', '5000']],
           ['Плёнка', 'Плёнка(ico)', ['', '', '', '', '', '', '', '', '+30%', '', '5000']],
           ['Пружина', 'Пружина(ico)', ['', '', '+30%', '', '', '', '', '', '', '', '5000']],
           ['Батарейка', 'Батарейка(ico)', ['', '', '', '', '', '+30%', '', '', '', '', '5000']]]];
}

export default Artefacts_storage;

